# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:  
  - [2, 4, 4, 2, 4, 3]
  - [4, 7, 8, 3, 8, 8]
  - [18, 12, 24, 40, 167, 86]
  #- [4, 4, 5, 5, 6, 6]
  #- [6, 8, 10, 6, 9, 9]
  #- [10, 10, 13, 13, 17, 17]
  #- [31, 14, 32, 36, 94, 85]
  #- [4, 2, 2, 4, 4, 4] # P3/8
  #- [7, 2, 9, 6, 7, 12] # P4/16
  #- [21, 11, 34, 35, 119, 92] # P5/32
  #- [13,13,  15,33,  32,20]  
  #- [27,57,  45,41,  98,43]  
  #- [54,105,  154,60,  93,171]
  #- [12,16, 19,36, 40,28]  # P3/8
  #- [36,75, 76,55, 72,146]  # P4/16
  #- [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Split, [32, 3, 1]],  # 0
  
   [-1, 1, Conv2, [64, 3, 2, 0]],  # 1-P1/2  
   [-2, 1, Conv2, [64, 3, 2, 1]],  # 2-P1/2  
   
   [[1,2], 1, CBAM_F, [64]], # 3-P2/4
   [[1,3], 1, Add, [64,0]],  # 4-P2/4 stream one:x+trans[0]
   
  ## 2nd attention block - A
   [4, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [128, 3, 2]],  # 6-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 14
         
   [-1, 1, MP, []], # 15
  
  ## 2nd attention block - B
   [2, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 17-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 25
         
   [-1, 1, MP, []], # 26

  ## 2nd attention block - ADD
   [[15,26], 1, CBAM_F, [256]], # 27-P2/4
   [[15,27], 1, Add, [256,0]],  # 28-P2/4 stream one:x+trans[0]

  ## 3rd attention block - A
   [-1, 1, Conv, [128, 1, 1]],
   [14, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 32-P3/8  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 40 => concat
         
   [-1, 1, MP, []], # 41
   
  ## 3rd attention block - B
   [26, 1, Conv, [128, 1, 1]],
   [25, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 45-P3/8  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 53
         
   [-1, 1, MP, []], # 54

  ## 3rd attention block - ADD
   [[41,54], 1, CBAM_F, [512]], # 55-P2/4
   [[41,55], 1, Add, [512,0]],  # 56-P2/4 stream one:x+trans[0]

  ## 4th attention block - A
   [-1, 1, Conv, [256, 1, 1]],
   [40, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 60-P4/16  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 68 => concat
         
   [-1, 1, MP, []], # 69

  ## 4th attention block - B
   [54, 1, Conv, [256, 1, 1]],
   [53, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 73-P4/16  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 81 => concat
         
   [-1, 1, MP, []], # 82

   ## 4th attention block - ADD
   [[69,82], 1, CBAM_F, [1024]], # 83-P2/4
   [[69,83], 1, Add, [1024,0]],  # 84-P2/4 stream one:x+trans[0]
         
  ## rest of the blocks
   [-1, 1, Conv, [512, 1, 1]],
   [68, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 88-P5/32  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 96
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 97 => concat
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [68, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 109 => concat
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [40, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 121
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 109], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 134
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 97], 1, Concat, [1]],
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 147
   
   [121, 1, RepConv, [256, 3, 1]],
   [134, 1, RepConv, [512, 3, 1]],
   [147, 1, RepConv, [1024, 3, 1]],

   [[148,149,150], 1, Polygon_Detect, [nc, anchors]],   
    # POLYGON: Polygon_Detect(P3, P4, P5) [17, 20, 23] represents the layer index
  ]
