# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:  
  - [2, 4, 4, 2, 4, 3]
  - [4, 7, 8, 3, 8, 8]
  - [18, 12, 24, 40, 167, 86]
  #- [4, 4, 5, 5, 6, 6]
  #- [6, 8, 10, 6, 9, 9]
  #- [10, 10, 13, 13, 17, 17]
  #- [31, 14, 32, 36, 94, 85]
  #- [4, 2, 2, 4, 4, 4] # P3/8
  #- [7, 2, 9, 6, 7, 12] # P4/16
  #- [21, 11, 34, 35, 119, 92] # P5/32
  #- [13,13,  15,33,  32,20]  
  #- [27,57,  45,41,  98,43]  
  #- [54,105,  154,60,  93,171]
  #- [12,16, 19,36, 40,28]  # P3/8
  #- [36,75, 76,55, 72,146]  # P4/16
  #- [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Split, [32, 3, 1]],  # 0
  
   [-1, 1, Conv2, [64, 3, 2, 0]],  # 1-P1/2  
   [-2, 1, Conv2, [64, 3, 2, 1]],  # 2-P1/2  
   
   [[1,2], 1, GPT, [64]], # 3-P2/4
   [[1,3], 1, Add2, [64,0]],  # 4-P2/4 stream one:x+trans[0]
   [[2,3], 1, Add2, [64,1]],  # 5-P2/4 stream two:x+trans[1]
  
  ## 2nd attention block - A
   [4, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [128, 3, 2]],  # 7-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 15
         
   [-1, 1, MP, []], # 16
  
  ## 2nd attention block - B
   [5, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 18-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 26 
         
   [-1, 1, MP, []], # 27

  ## 2nd attention block - ADD
   [[16,27], 1, GPT, [256]], # 28-P2/4
   [[16,28], 1, Add2, [256,0]],  # 29-P2/4 stream one:x+trans[0]
   [[27,28], 1, Add2, [256,1]],  # 30-P2/4 stream two:x+trans[1]

  ## 3rd attention block - A
   [29, 1, Conv, [128, 1, 1]],
   [15, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 34-P3/8  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 42 => concat
         
   [-1, 1, MP, []], # 43
   
  ## 3rd attention block - B
   [30, 1, Conv, [128, 1, 1]],
   [26, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 47-P3/8  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 55 
         
   [-1, 1, MP, []], # 56

  ## 3rd attention block - ADD
   [[43,56], 1, GPT, [512]], # 57-P2/4
   [[43,57], 1, Add2, [512,0]],  # 58-P2/4 stream one:x+trans[0]
   [[56,57], 1, Add2, [512,1]],  # x-P2/4 stream two:x+trans[1]

  ## 4th attention block - A
   [58, 1, Conv, [256, 1, 1]],
   [42, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 62-P4/16  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 70 => concat
         
   [-1, 1, MP, []], # 71
         
  ## rest of the blocks
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 75-P5/32  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 83
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 84 => concat
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [70, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 96 => concat
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [42, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 108
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 96], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 121
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 84], 1, Concat, [1]],
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 134
   
   [108, 1, RepConv, [256, 3, 1]],
   [121, 1, RepConv, [512, 3, 1]],
   [134, 1, RepConv, [1024, 3, 1]],

   [[135,136,137], 1, Polygon_Detect, [nc, anchors]],   
    # POLYGON: Polygon_Detect(P3, P4, P5) [17, 20, 23] represents the layer index
  ]
