# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:  
  - [2, 4, 4, 2, 4, 3]
  - [4, 7, 8, 3, 8, 8]
  - [18, 12, 24, 40, 167, 86]
  #- [4, 4, 5, 5, 6, 6]
  #- [6, 8, 10, 6, 9, 9]
  #- [10, 10, 13, 13, 17, 17]
  #- [31, 14, 32, 36, 94, 85]
  #- [4, 2, 2, 4, 4, 4] # P3/8
  #- [7, 2, 9, 6, 7, 12] # P4/16
  #- [21, 11, 34, 35, 119, 92] # P5/32
  #- [13,13,  15,33,  32,20]  
  #- [27,57,  45,41,  98,43]  
  #- [54,105,  154,60,  93,171]
  #- [12,16, 19,36, 40,28]  # P3/8
  #- [36,75, 76,55, 72,146]  # P4/16
  #- [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  ###############################
  ## 1st Transformer Block - A ##
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  

  ## 1st Transformer Block - B ##
   [-4, 1, Conv, [32, 3, 1]],  # 4
  
   [-1, 1, Conv, [64, 3, 2]],  # 5-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [128, 3, 2]],  # 7-P2/4  

  ## 1st Transformer Block - Transformer ##
   [[3,7], 1, GPT, [128]], # 8-P2/4
   [[3,8], 1, Add2, [128,0]],  # 9-P2/4 stream one:x+trans[0]
   [[7,8], 1, Add2, [128,1]],  # 10-P2/4 stream two:x+trans[1]
  
  ###############################
  ## 2nd Transformer Block - B ##
   [9, 1, Conv, [64, 1, 1]],
   [9, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 18-P3/8

  ## 2nd Transformer Block - B ##   
   [10, 1, Conv, [64, 1, 1]],
   [10, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 26-P3/8

   ## 2nd Transformer Block - Fusion $$
   [[18,26], 1, GPT, [256]], # 27-P3/8
   [[18,27], 1, Add2, [256,0]],  # 28-P3/8 stream one:x+trans[0]
   [[26,27], 1, Add2, [256,1]],  # 29-P3/8 stream two:x+trans[1]
   
   ###############################
   ## 3rd Transformer Block - A ##
   [28, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]], 
   [26, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 34-P3/4  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 42

   ## 3rd Transformer Block - B ##
   [29, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [26, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 47-P3/4  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 55

   ## 3rd Transformer Block - Fusion ##
   [[42,55], 1, GPT, [512]],   # 56-P3/16
   [[42,56], 1, Add2, [512,0]],    # 57-P3/16 stream one x+trans[0]
   [[55,56], 1, Add2, [512,1]],    # 58-P3/16 stream two x+trans[1]

   ############################### 
   ## 4th Transformer Block - A ##
   [57, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [55, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 63-P4/16  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 71
  ## 4th Transformer Block - B ##       
   [58, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [55, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 76-P5/32  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 84
  ## 4th Transformer Block - Fusion ##
   [[71,84], 1, GPT, [1024]],   # 85-P6/32
   [[71,85], 1, Add2, [1024,0]],    # 86-P6/32 stream one x+trans[0]
   [[84,85], 1, Add2, [1024,1]],    # 87-P6/32 stream two x+trans[1]

  ######### Add Block ###########
   [[28,29], 1, Add, [1]],   # 88-P3/8 fusion backbone P3
   [[57,58], 1, Add, [1]],   # 89-P4/16 fusion backbone P4
   [[86,87], 1, Add, [1]],   # 90-P5/32 fusion backbone P5
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 91
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [89, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 103
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [88, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], #115
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 103], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 128
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 91], 1, Concat, [1]],
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 141
   
   [115, 1, RepConv, [256, 3, 1]], # 142
   [128, 1, RepConv, [512, 3, 1]], # 143
   [141, 1, RepConv, [1024, 3, 1]], # 144

   [[142,143,144], 1, Polygon_Detect, [nc, anchors]],   
    # POLYGON: Polygon_Detect(P3, P4, P5) [17, 20, 23] represents the layer index
  ]
