# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:  
  - [2, 4, 4, 2, 4, 3]
  - [4, 7, 8, 3, 8, 8]
  - [18, 12, 24, 40, 167, 86]
  #- [4, 4, 5, 5, 6, 6]
  #- [6, 8, 10, 6, 9, 9]
  #- [10, 10, 13, 13, 17, 17]
  #- [31, 14, 32, 36, 94, 85]
  #- [4, 2, 2, 4, 4, 4] # P3/8
  #- [7, 2, 9, 6, 7, 12] # P4/16
  #- [21, 11, 34, 35, 119, 92] # P5/32
  #- [13,13,  15,33,  32,20]  
  #- [27,57,  45,41,  98,43]  
  #- [54,105,  154,60,  93,171]
  #- [12,16, 19,36, 40,28]  # P3/8
  #- [36,75, 76,55, 72,146]  # P4/16
  #- [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Split, [32, 3, 1]],  # 0
  
   [-1, 1, Conv2, [64, 3, 2, 0]],  # 1-P1/2  
   [-2, 1, Conv2, [64, 3, 2, 1]],  # 2-P1/2  
   
   [-1, 1, CBAM, [64]], # 3-P2/4
   [[1,3], 1, Add, [64,0]],  # 4-P2/4 stream one:x+trans[0]
  
  ## 2nd attention block - A
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [128, 3, 2]],  # 6-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 14
         
   [-1, 1, MP, []], # 15

  ## 2nd attention block - ADD
   [-1, 1, CBAM, [256]], # 16-P2/4
   [[15,16], 1, Add, [256,0]],  # 17-P2/4 stream one:x+trans[0]

  ## 3rd attention block - A
   [-1, 1, Conv, [128, 1, 1]],
   [14, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 21-P3/8  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 29 => concat
         
   [-1, 1, MP, []], # 30

  ## 3rd attention block - ADD
   [-1, 1, CBAM, [512]], # 31-P2/4
   [[30,31], 1, Add, [512,0]],  # 32-P2/4 stream one:x+trans[0]

  ## 4th attention block - A
   [-1, 1, Conv, [256, 1, 1]],
   [29, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 36-P4/16  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 44 => concat
         
   [-1, 1, MP, []], # 45

   ## 4th attention block - ADD
   [-1, 1, CBAM, [1024]], # 46-P2/4
   [[45,46], 1, Add, [1024,0]],  # 47-P2/4 stream one:x+trans[0]
         
  ## rest of the blocks
   [-1, 1, Conv, [512, 1, 1]],
   [44, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 51-P5/32  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 59
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 60 => concat
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [44, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 72 => concat
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [29, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 84
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 72], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 97
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 60], 1, Concat, [1]],
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 110
   
   [84, 1, RepConv, [256, 3, 1]],
   [97, 1, RepConv, [512, 3, 1]],
   [110, 1, RepConv, [1024, 3, 1]],

   [[111,112,113], 1, Polygon_Detect, [nc, anchors]],   
    # POLYGON: Polygon_Detect(P3, P4, P5) [17, 20, 23] represents the layer index
  ]
